app/controllers/ideas_controller.rb

SELECT "ideas".* FROM "ideas"
---
  def index
    @ideas = Idea.all

INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pau"], ["description", "Arte"], ["picture", "#<ActionDispatch::Http::UploadedFile:0x007fb8e00baa40>"], ["created_at", 2016-11-19 18:01:29 UTC], ["updated_at", 2016-11-19 18:01:29 UTC]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["picture", "IMG_6872.JPG"], ["updated_at", 2016-11-19 18:05:21 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)

SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_idea
      @idea = Idea.find(params[:id])